{
  "basic_example": "A chill lo-fi hip hop track with smooth jazzy piano and laid-back beats. Lyrics about late night creative sessions and finding inspiration in the quiet hours.\n\n[VERSE]\nMidnight oil burning bright\nThoughts flow freely in the night\nSilence speaks the loudest now\nCreativity shows me how\n\n[CHORUS]\nQuiet hours, loud mind\nLeaving all the stress behind\nIn this space between the days\nInspiration finds its ways",
  "basic_example_description": "This basic example uses a simple descriptive prompt followed by structured lyrics with VERSE and CHORUS tags. It provides a straightforward but effective framework for generating a cohesive lo-fi track.",
  
  "advanced_example": "temperature=0.7 guidance=6.5 key_signature=G minor tempo=85\n\nA downtempo electronic track with ambient textures and jazz influences. Deep, resonant bass with glitchy percussion and atmospheric synth pads. Contemplative female vocals with lyrics about urban solitude and finding beauty in everyday moments.\n\n[VERSE 1]\nCity lights reflect in puddles on the street\nStrangers passing by but no one stops to meet\nHeadphones in, I create my bubble here\nSounds transform my world and make it disappear\n\n[PRE-CHORUS]\nIn between the chaos and the quiet\nIn between the darkness and the light\n\n[CHORUS]\nBeauty hides in ordinary places\nMoments caught between the empty spaces\nSlowing down to see what others miss\nFinding peace within the city's hiss",
  "advanced_example_description": "This advanced example uses specific technical parameters at the top, followed by a more detailed style description that references specific sound elements. It includes PRE-CHORUS tags and more nuanced lyrical themes with urban imagery.",
  
  "complex_example": "temperature=0.8 guidance=7.0 key_signature=D major tempo=110 length=180\n\n[GENRE] Cinematic electronic with orchestral elements and post-rock influences\n[FEELING] Triumphant, uplifting, with underlying tension that resolves\n[FORM] Intro-Verse-Pre-Chorus-Chorus-Verse-Chorus-Bridge-Chorus-Outro\n[INSTRUMENTS] Orchestra strings, piano, electronic drums, analog synths, electric bass, ambient pads\n[SUBJECT] Overcoming insurmountable obstacles and finding inner strength through adversity\n\n[INTRO]\n(Soft piano with ambient textures, gradually adding strings)\n\n[VERSE 1]\nFaced with mountains seemingly too high to climb\nShackled by doubts that have haunted me for time\nWhispers of failure echo in my mind\nTelling me to leave my ambitions behind\n\n[PRE-CHORUS]\nBut deep within this heart of mine\nAn ember glows, refusing to decline\n\n[CHORUS]\nRising from the ashes of my fear\nFinding strength I never knew was here\nBreaking through the walls I've built so high\nSpread my wings, now watch me touch the sky\n\n[BRIDGE]\nThe journey's never straight or clear\nThe path ahead may disappear\nBut every step I choose to take\nBuilds the future I want to make\n\n[OUTRO]\n(Gradual build to cinematic climax with full orchestration, then gentle fade to solo piano)",
  "complex_example_description": "This complex example uses precise parameters, multiple meta-tags for different aspects of the composition, and a complete song structure with detailed instrumental direction. It demonstrates how to create a comprehensive prompt for maximum control over both musical and lyrical elements."
}